<template>
  <div class="rules-content">
    <h3>⼀、活动时间</h3>
    <p>新途天⽓APP对活动时间拥有决定权，活动上线即代表活动开始，活动下线即代表活动结束</p>

    <h3>⼆、参与⽅式</h3>
    <p>活动期间，⽤户可下载APP新途天⽓进⼊活动页⾯参与；</p>
    <h3>三、活动介绍</h3>
    <p>1、⽤户可通过付费/看视频获取商品专属的中奖码；</p>
    <p>2、次⽇11：00开奖，平台公布商品的开奖码；</p>
    <p>3、⽤户已获得的中奖码与开奖码⼀致即为中奖，即可获得对应商品；</p>
    <h3>四、中奖码生成规则</h3>
    <p>为8位数字，每位数字在0-9中随机生成</p>
    <h3>五、开奖码生成规则</h3>
    <p>为8位数字，每位数字在0-9中随机生成</p>
    <h3>六、退款规则</h3>
    <p>1、如用户选择了19.9元专区的商品进行抽奖，次日未中奖，不可以退款；</p>
    <p>2、如用户选择了39.9元专区的商品进行抽奖，次日未中奖，可通过在参与记录页面申请退款，看50次视频即可全额退款；</p>
    <p>3、如用户选择了199元专区的商品进行抽奖，次日未中奖，可通过在参与记录页面申请退款，看50次视频即可全额退款；</p>
    <h3>七、有问题如何联系我们？</h3>
    <p>关于本次活动的任何问题，可在新途天气APP首页咨询在线客服，我们将在线为您解答。</p>
    <h3>八、⽤户⾏为规范</h3>
    <p>1、在参与活动及奖品领取和使⽤期间，⽤户应严格遵守法律法规的规定，遵循诚实信⽤原则，不从事任何违反国家法律法规、违反本规则，或从事任何扰乱新途天⽓平台秩序、违反公序良俗、侵害社
    会公共利益、他⼈利益以及新途天⽓利益的⾏为；</p>
    <p>2、活动⽅有权根据⽤户注册/登录信息、⽤户⾏为、及普通⼈的正常消费，交易习惯、互联⽹领域⾏
    业惯例、⽣活常识等因素判定⽤户是否存在违规⾏为或者账号是否存在异常，并根据判定结果采取处
    理措施；</p>
    <p>3、禁⽌使⽤违规⼯具或者技术参与活动或进⾏刷量操作，如发现⽤户以不正当⼿段或舞弊⽅式参与
    本活动，新途天⽓有权对⽤户账户进⾏异常标记并回收所获奖励。不正当⼿段包括但不限于使⽤⾮法
    插件、外挂等⼯具刷量多个中奖码。</p>
    <h3>九、其它说明</h3>
    <p>1、如活动规则有变动，包括中奖码获得方式、开奖方式、退款方式、退款金额等等，请以平台实际变动为准，新途天气拥有法律规定内的解释权；</p>
    <p>2、本活动涉及的奖品，包括空调，彩电，冰箱，电饭煲等等，因特殊性质，不⽀持兑换现⾦和7天⽆
    理由退货；</p>
    <p>3、参与活动前，请仔细阅读活动规则的各个条款，特别是与活动规则、中奖规则、退款规则、活动奖品以及用户账号异常/违规等相关的条款。用户通过付费/看视频参与本活动即视为已充分阅读、理解本活动规则，并自愿受活动规则的约束；</p>
    <p> 4、活动期间如出现不可抗⼒或者情势变更的情况（包括但不限于重⼤灾害或疫情时间、活动受政府
    指令要求停办或调整的，活动遭受⽹络攻击或因系统故障需要暂停举办的），新途天⽓有权暂停或者
    取消本次活动，并可依相关法律法规的规定主张免责；</p>
    <p>5、本活动由新途天⽓APP发起，新途天⽓拥有法律规定内的解释权；</p>
    <p>6、本活动仅限18周岁以上中国⼤陆公民参加；</p>
  </div>
</template>
<script>
import { onBeforeMount } from "vue";
export default {
  setup() {
    onBeforeMount(() => {
      document.title = "抽奖规则"
    });
  }
}
</script>
<style lang="less" scoped>
@import url(./index.less);
</style>
